app/views/pessoas/_form.html.erb

SELECT `interesses`.* FROM `interesses`
SELECT  1 AS one FROM `interesses` INNER JOIN `interesses_pessoas` ON `interesses`.`id` = `interesses_pessoas`.`interess_id` WHERE `interesses_pessoas`.`pessoa_id` = 1 AND `interesses`.`id` = 1 LIMIT 1
---

 <% for interesse in Interess.all %>
<tr>
<td><%= check_box_tag "pessoa[interess_ids][]", interesse.id, @pessoa.interesses.include?(interesse) %></td>