app/views/home/index.html.erb

<%if user_signed_in?%>
<% if current_user.pessoa.present?%>
---
SELECT  "pessoas".* FROM "pessoas"  WHERE "pessoas"."user_id" = ? LIMIT 1  [["user_id", 1]]