app/controllers/home_controller.rb

  def locais
    interesses = Array.new
    @client = GooglePlaces::Client.new(API_KEY)
    current_user.pessoa.interesses.each do |int|
---
SELECT  "pessoas".* FROM "pessoas"  WHERE "pessoas"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT `interesses`.* FROM `interesses` INNER JOIN `interesses_pessoas` ON `interesses`.`id` = `interesses_pessoas`.`interess_id` WHERE `interesses_pessoas`.`pessoa_id` = 1