app/controllers/pessoas_controller.rb

  def index
    @pessoas = Pessoa.all
---
SELECT `pessoas`.* FROM `pessoas`

  def create
    @pessoa = Pessoa.new(pessoa_params)
    @pessoa.user_id = current_user.id

    respond_to do |format|
      if @pessoa.save
---
INSERT INTO `pessoas` (`created_at`, `endereco`, `idade`, `latitude`, `longitude`, `nome`, `updated_at`, `user_id`) VALUES ('2014-09-20 18:18:05', 'Rua Angelo Vicentim - 1046, SP, Brasil', 28, -22.833739, -47.082384, 'Alexandre Soares', '2014-09-20 18:18:05', 1)

  def update
    respond_to do |format|
      if @pessoa.update(pessoa_params)
---
UPDATE `pessoas` SET `latitude` = -22.833739, `longitude` = -47.082384, `updated_at` = '2014-09-20 19:03:09' WHERE `pessoas`.`id` = 1

    def set_pessoa
      @pessoa = Pessoa.find(params[:id])
---
SELECT  "pessoas".* FROM "pessoas"  WHERE "pessoas"."id" = ? LIMIT 1  [["id", 1]]